LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
        if (level <= 10 && (low_battery_alert_mask_ & 0x01) == 0) {
            low_battery_alert_mask_ |= 0x01;
            StartLowBatteryAlertSequence();
        }
    }

    static void battery_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr && self->charge_ != nullptr) {
                if (self->charge_->Update()) {
                    self->HandleBatteryEmotions();
                }
            }
            vTaskDelay(pdMS_TO_TICKS(300));
        }
    }

    static void imu_event_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr || !self->bmi270_ready_) {
            vTaskDelete(NULL);
            return;
        }

        struct bmi2_sens_data prev = {};
        struct bmi2_sens_data cur = {};
        bool has_prev = false;
        int64_t last_shake_ms = 0;
        constexpr int kShakeDeltaThreshold = 20000;
        constexpr int64_t kShakeCooldownMs = 2000;

        while (true) {
            if (Bmi270Motion::ReadAccelRaw(cur)) {
                if (has_prev) {
                    int dx = abs(static_cast<int>(cur.acc.x) - static_cast<int>(prev.acc.x));
                    int dy = abs(static_cast<int>(cur.acc.y) - static_cast<int>(prev.acc.y));
                    int dz = abs(static_cast<int>(cur.acc.z) - static_cast<int>(prev.acc.z));
                    int shake_score = dx + dy + dz;

                    int64_t now_ms = esp_timer_get_time() / 1000;
                    if (shake_score > kShakeDeltaThreshold && (now_ms - last_shake_ms) > kShakeCooldownMs) {
                        last_shake_ms = now_ms;
                        // "dizzy/nauseated" are not guaranteed in current assets, use supported fallback.
                        self->ShowTemporaryEmotion("confused", 1800);
                    }
                }
                prev = cur;
                has_prev = true;
            }
            vTaskDelay(pdMS_TO_TICKS(80));
        }
    }

    void InitializeI2c()
    {
        i2c_config_t i2c_cfg = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .sda_pullup_en = true,
            .scl_pullup_en = true,
            .master = {
                .clk_speed = 400000,
            },
            .clk_flags = 0,
        };
        shared_i2c_bus_handle_ = i2c_bus_create(I2C_NUM_0, &i2c_cfg);
        if (!shared_i2c_bus_handle_) {
            ESP_LOGE(TAG, "Failed to create shared I2C bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && !CONFIG_I2C_BUS_BACKWARD_CONFIG
        i2c_bus_ = i2c_bus_get_internal_bus_handle(shared_i2c_bus_handle_);
#else
#error "ESP-VoCat board requires i2c_bus_get_internal_bus_handle() support"
#endif
        if (!i2c_bus_) {
            ESP_LOGE(TAG, "Failed to get I2C master handle");
            ESP_ERROR_CHECK(ESP_FAIL);
        }

        temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
        ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));
        ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));
    }
    uint8_t DetectPcbVersion()
        {
            gpio_config_t gpio_conf = {
                .pin_bit_mask = (1ULL << CORDEC_POWER_CTRL),
                .mode = GPIO_MODE_OUTPUT,
                .pull_up_en = GPIO_PULLUP_DISABLE,
                .pull_down_en = GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE
            };
            ESP_ERROR_CHECK(gpio_config(&gpio_conf));
            ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 0));
            vTaskDelay(pdMS_TO_TICKS(50));

            bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            uint8_t pcb_version = 0;
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.0");
                pcb_version = 0;
            } else {
                ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
                vTaskDelay(pdMS_TO_TICKS(50));
                codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
                if (codec_alive) {
                    ESP_LOGI(TAG, "PCB version V1.2");
                    pcb_version = 1;
                    AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                    AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                    QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                    TOUCH_PAD2 = TOUCH_PAD2_2;
                    UART1_TX = UART1_TX_2;
                    UART1_RX = UART1_RX_2;
                } else {
                    ESP_LOGE(TAG, "PCB version detection error");
                }
            }
            return pcb_version;
        }

    bool ProbeI2cDevice(uint8_t address, const char* device_name)
    {
        constexpr int kProbeAttempts = 3;
        esp_err_t ret = ESP_FAIL;
        for (int i = 0; i < kProbeAttempts; ++i) {
            ret = i2c_master_probe(i2c_bus_, address, 100);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "%s detected at I2C address 0x%02X", device_name, address);
                return true;
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
        ESP_LOGW(TAG, "%s not detected at I2C address 0x%02X: %s",
                 device_name, address, esp_err_to_name(ret));
        return false;
    }

    emote::EmoteDisplay* TouchDisplay()
    {
        return dynamic_cast<emote::EmoteDisplay*>(display_);
    }

    static int SliderValueFromX(int x)
    {
        return std::clamp((x - 45) * 100 / 270, 0, 100);
    }

    static const char* TouchPageName(TouchPage page)
    {
        switch (page) {
            case TouchPage::kHidden: return "hidden";
            case TouchPage::kPulling: return "pulling";
            case TouchPage::kMenu: return "menu";
            case TouchPage::kVolume: return "volume";
            case TouchPage::kBrightness: return "brightness";
            case TouchPage::kWallpaper: return "wallpaper";
            case TouchPage::kMusic: return "music";
            case TouchPage::kMusicPlayback: return "music_playback";
        }
        return "unknown";
    }

    static void TouchInterruptCallback(esp_lcd_touch_handle_t touch)
    {
        auto* self = touch ? static_cast<EspVocat*>(touch->config.user_data) : nullptr;
        if (self && self->touch_task_handle_) {
            BaseType_t higher_priority_task_woken = pdFALSE;
            vTaskNotifyGiveFromISR(self->touch_task_handle_, &higher_priority_task_woken);
            portYIELD_FROM_ISR(higher_priority_task_woken);
        }
    }

    void RenderMusicPage()
    {
        auto* emote_display = TouchDisplay();
        if (!emote_display || !music_player_) return;
        const auto snapshot = music_player_->GetUiSnapshot();
        if (snapshot.titles.empty()) {
            music_selected_index_ = -1;
        } else if (music_selected_index_ < 0 ||
                   music_selected_index_ >= static_cast<int>(snapshot.titles.size())) {
            music_selected_index_ = snapshot.current_index >= 0
                ? snapshot.current_index : 0;
            music_first_index_ = std::max(0, music_selected_index_ - 2);
        }
        const int max_first = std::max(0, static_cast<int>(snapshot.titles.size()) - 5);
        music_first_index_ = std::clamp(music_first_index_, 0, max_first);
        const char* status = snapshot.library_ready ? "暂无歌曲"
                             : snapshot.library_error.empty() ? "正在读取音乐列表…"
                                                              : snapshot.library_error.c_str();
        emote_display->ShowTouchMusic(snapshot.titles, music_first_index_,
                                      music_selected_index_, status);
        music_ui_refresh_us_ = esp_timer_get_time();
    }

    void CloseTouchSettings()
    {
        ESP_LOGI(TAG, "Touch UI close from page=%s", TouchPageName(touch_page_));
        if (auto* emote_display = TouchDisplay()) {
            emote_display->HideTouchSettings();
        }
        touch_page_ = TouchPage::kHidden;
        slider_dragging_ = false;
    }

