LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
        };
        ESP_ERROR_CHECK(gpio_config(&power_gpio_config));

        gpio_set_level(POWER_CTRL, 0);
    }

#ifdef CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE
    void InitializeCamera() {
        esp_video_init_usb_uvc_config_t usb_uvc_config = {
            .uvc = {
                .uvc_dev_num = 1,
                .task_stack = 4096,
                .task_priority = 5,
                .task_affinity = -1,
            },
            .usb = {
                .init_usb_host_lib = true,
                .task_stack = 4096,
                .task_priority = 5,
                .task_affinity = -1,
            },
        };

        esp_video_init_config_t video_config = {
            .usb_uvc = &usb_uvc_config,
        };

        camera_ = new EspVideo(video_config);
    }
#endif // CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE

public:
    ~EspVocat() {
        if (touch_task_handle_ != nullptr) {
            vTaskDelete(touch_task_handle_);
            touch_task_handle_ = nullptr;
        }
        media_transfer_.reset();
        // Music owns a worker that may update the display, so stop it before deleting display objects.
        music_player_.reset();

        // Stop tasks
        if (charge_task_handle_ != nullptr) {
            vTaskDelete(charge_task_handle_);
        }
        if (imu_task_handle_ != nullptr) {
            vTaskDelete(imu_task_handle_);
        }
        if (touch_slider_task_handle_ != nullptr) {
            vTaskDelete(touch_slider_task_handle_);
            touch_slider_task_handle_ = nullptr;
        }
        if (touch_button_handle_ != nullptr) {
            touch_button_sensor_delete(touch_button_handle_);
            touch_button_handle_ = nullptr;
        }

        // Delete objects
        delete charge_;
        if (tp_ != nullptr) {
            esp_lcd_touch_del(tp_);
            tp_ = nullptr;
        }
        if (touch_io_ != nullptr) {
            esp_lcd_panel_io_del(touch_io_);
            touch_io_ = nullptr;
        }
        delete display_;
        // Note: backlight_ (PwmBacklight) and camera_ (EspVideo) are not deleted here
        // because their base classes (Backlight, Camera) don't have virtual destructors.
        // Since EspVocat is a singleton that lives for the device lifetime, this is acceptable.

        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_delete(emotion_reset_timer_);
            emotion_reset_timer_ = nullptr;
        }

        // Disable temperature sensor
        if (temp_sensor != NULL) {
            temperature_sensor_disable(temp_sensor);
            temperature_sensor_uninstall(temp_sensor);
            temp_sensor = NULL;
        }
    }

    EspVocat() : boot_button_(BOOT_BUTTON_GPIO)
    {
        const esp_timer_create_args_t emotion_timer_args = {
            .callback = &EspVocat::emotion_reset_timer_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "emotion_rst",
            .skip_unhandled_events = true,
        };
        ESP_ERROR_CHECK(esp_timer_create(&emotion_timer_args, &emotion_reset_timer_));

        InitializeI2c();
        uint8_t pcb_version = DetectPcbVersion();
        InitializeCharge();
        InitializeBmi270();

        InitializeSpi();
        InitializeSt77916Display(pcb_version);
        InitializeButtons();
        InitializeCapacitiveTouchPads();
        SdCardManager::GetInstance().Initialize({
            .mount_point = "/sdcard",
            .clk = SD_CARD_CLK_GPIO,
            .cmd = SD_CARD_CMD_GPIO,
            .d0 = SD_CARD_D0_GPIO,
            .max_files = 6,
        });
        music_player_ = std::make_unique<SdMusicPlayer>();
        music_player_->RegisterMcpTools();
        InitializeCst816sTouchPad();
        RegisterWallpaperMcpTools();
        if (auto* emote_display = dynamic_cast<emote::EmoteDisplay*>(display_)) {
            emote_display->RefreshCustomWallpapers();
            media_transfer_ = std::make_unique<MediaTransferServer>(
                [emote_display]() { emote_display->RequestCustomWallpaperRefresh(); },
                [this]() { music_player_->RequestLibraryRefresh(); },
                [this]() { return music_player_->IsActive(); },
                [emote_display](const std::string& url) { emote_display->ShowMediaTransferQr(url.c_str()); },
                [emote_display](const std::string&) { emote_display->HideMediaTransferQr(); });
            RegisterMediaTransferMcpTools();
        }
#ifdef CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE
        InitializeCamera();
#endif // CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE
    }

    virtual AudioCodec* GetAudioCodec() override
    {
        static BoxAudioCodec audio_codec(
            i2c_bus_,
            AUDIO_INPUT_SAMPLE_RATE,
            AUDIO_OUTPUT_SAMPLE_RATE,
            AUDIO_I2S_GPIO_MCLK,
            AUDIO_I2S_GPIO_BCLK,
            AUDIO_I2S_GPIO_WS,
            AUDIO_I2S_GPIO_DOUT,
            AUDIO_I2S_GPIO_DIN,
            AUDIO_CODEC_PA_PIN,
            AUDIO_CODEC_ES8311_ADDR,
            AUDIO_CODEC_ES7210_ADDR,
            AUDIO_INPUT_REFERENCE);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override
    {
        return display_;
    }

    esp_lcd_touch_handle_t GetTouchpad()
    {
        return tp_;
    }

    virtual Backlight* GetBacklight() override
    {
        return backlight_;
    }

    virtual Camera* GetCamera() override {
        return camera_;
    }

    virtual bool GetBatteryLevel(int& level, bool& charging, bool& discharging) override {
        Charge::BatteryInfo battery_info;
        if (charge_ == nullptr) {
            return false;
        }
        charge_->GetBatteryInfo(battery_info);
        level = battery_info.level;
        charging = battery_info.charging;
        discharging = battery_info.discharging;
        return true;
    }

    virtual bool GetBatteryDetail(int& level, bool& charging, bool& discharging,
                                  int& voltage_mv, int& current_ma) override {
        Charge::BatteryInfo battery_info;
        if (charge_ == nullptr) {
            return false;
        }
        charge_->GetBatteryInfo(battery_info);
        level = battery_info.level;
        charging = battery_info.charging;
        discharging = battery_info.discharging;
        voltage_mv = battery_info.voltage_mv;
        current_ma = battery_info.current_ma;
        return true;
    }
};

DECLARE_BOARD(EspVocat);
